In [1]:
import pandas as pd
import numpy as np

In [2]:
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline 
sns.set(color_codes=True)

In [26]:
df_train = pd.read_csv('data/train.csv')
df_test = pd.read_csv('data/test.csv', sep=';')
df_edades = pd.read_csv('edades.csv')

In [27]:
print(f'tama単o datos - entrenamiento: {df_train.shape}, test: {df_test.shape}')

tama単o datos - entrenamiento: (891, 12), test: (418, 11)

In [28]:
df_train['is_test'] = 1
df_test['is_test'] = 0
df_test['Survived'] = np.NaN

In [29]:
df_train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked', 'is_test'],
      dtype='object')

In [30]:
df_test.columns

Index(['PassengerId', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch',
       'Ticket', 'Fare', 'Cabin', 'Embarked', 'is_test', 'Survived'],
      dtype='object')

In [31]:
df_titanic = pd.concat([df_train,df_test])

In [32]:
df_cd = pd.merge(df_titanic, df_edades, how='outer', on = 'PassengerId')
df_cd.count()

PassengerId    1309
Survived        891
Pclass         1309
Name           1309
Sex            1309
Age            1046
SibSp          1309
Parch          1309
Ticket         1309
Fare           1308
Cabin           295
Embarked       1307
is_test        1309
edad            239
dtype: int64

In [33]:
df_cd.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,is_test,edad
0,1,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1,NaN
1,2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1,NaN
2,3,1.0,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1,NaN
3,4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1,NaN
4,5,0.0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1,NaN

In [22]:
print(f'tama単o datos - titanic: {df_titanic.shape}')

tama単o datos - titanic: (1309, 13)

In [23]:
#df_titanic.columns

column_sp = {
'Pclass'   :'Clase',
'SibSp'   :'hermcony',
'Parch'  :'padhijos',
'Fare'  :'Tarifa'}

df_train.rename(column_sp,axis=1,inplace=True)
df_titanic.rename(column_sp,axis=1,inplace=True)

In [24]:
df_titanic.count()

PassengerId    1309
Survived        891
Pclass         1309
Name           1309
Sex            1309
Age            1046
SibSp          1309
Parch          1309
Ticket         1309
Fare           1308
Cabin           295
Embarked       1307
is_test        1309
dtype: int64

In [ ]:
df_train.count()
#df_train.info()

In [ ]:
df_test.count()

In [10]:
df_titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,is_test,PassengerId;Pclass;Name;Sex;Age;SibSp;Parch;Ticket;Fare;Cabin;Embarked
0,1.0,0.0,3.0,"Braund, Mr. Owen Harris",male,22.0,1.0,0.0,A/5 21171,7.2500,NaN,S,1,NaN
1,2.0,1.0,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,PC 17599,71.2833,C85,C,1,NaN
2,3.0,1.0,3.0,"Heikkinen, Miss. Laina",female,26.0,0.0,0.0,STON/O2. 3101282,7.9250,NaN,S,1,NaN
3,4.0,1.0,1.0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0.0,113803,53.1000,C123,S,1,NaN
4,5.0,0.0,3.0,"Allen, Mr. William Henry",male,35.0,0.0,0.0,373450,8.0500,NaN,S,1,NaN

In [ ]:
#df_titanic['Pclass'] = df_titanic['Pclass'].astype('category')

In [ ]:
df_titanic.dtypes

In [ ]:
columns = ['Survived','Clase','Age','hermcony','padhijos','Tarifa']
df_corr = df_train[columns].copy()

In [ ]:
df_corr.head()

## Correlacion

In [ ]:
corr_train = df_corr.corr()
corr_train

In [ ]:
f, ax = plt.subplots(figsize=(10, 8))
#corr = df.corr()
sns.heatmap(corr_train,
            cmap='coolwarm',
            annot=True,
            xticklabels=corr_train.columns.values,
            yticklabels=corr_train.columns.values)

In [ ]:
sns.pairplot(df_train,hue='Survived')

In [ ]:
corr_titanic = df_titanic.corr()
corr_titanic

In [ ]:
f, ax = plt.subplots(figsize=(10, 8))
#corr = df.corr()
sns.heatmap(corr_titanic,
            cmap='coolwarm',
            annot=True,
            xticklabels=corr_titanic.columns.values,
            yticklabels=corr_titanic.columns.values)